zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f4a0-intc.h
#define HC32_SPI5_RBF_IRQ_NUM  INT099_IRQn
#define HC32_SPI5_RBF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_SPI5_TBE_IRQ_NUM  INT100_IRQn
#define HC32_SPI5_TBE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_SPI6_ERR_IRQ_NUM  INT101_IRQn
#define HC32_SPI6_ERR_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_SPI6_RBF_IRQ_NUM  INT102_IRQn
#define HC32_SPI6_RBF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_SPI6_TBE_IRQ_NUM  INT103_IRQn
#define HC32_SPI6_TBE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* RTC */
#define HC32_RTC_ALARM_IRQ_NUM  INT050_IRQn
#define HC32_RTC_ALARM_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_RTC_PRD_IRQ_NUM  INT051_IRQn
#define HC32_RTC_PRD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA1*/
#define HC32_TMRA1_OVF_IRQ_NUM  INT074_IRQn
#define HC32_TMRA1_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA1_UDF_IRQ_NUM  INT075_IRQn
#define HC32_TMRA1_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA1_CMP_IRQ_NUM  INT076_IRQn
#define HC32_TMRA1_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA2*/
#define HC32_TMRA2_OVF_IRQ_NUM  INT077_IRQn
#define HC32_TMRA2_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA2_UDF_IRQ_NUM  INT078_IRQn
#define HC32_TMRA2_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA2_CMP_IRQ_NUM  INT079_IRQn
#define HC32_TMRA2_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA3*/
#define HC32_TMRA3_OVF_IRQ_NUM  INT080_IRQn
#define HC32_TMRA3_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA3_UDF_IRQ_NUM  INT081_IRQn
#define HC32_TMRA3_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA3_CMP_IRQ_NUM  INT082_IRQn
#define HC32_TMRA3_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA4*/
#define HC32_TMRA4_OVF_IRQ_NUM  INT083_IRQn
#define HC32_TMRA4_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA4_UDF_IRQ_NUM  INT084_IRQn
#define HC32_TMRA4_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA4_CMP_IRQ_NUM  INT085_IRQn
#define HC32_TMRA4_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA5*/
#define HC32_TMRA5_OVF_IRQ_NUM  INT092_IRQn
#define HC32_TMRA5_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA5_UDF_IRQ_NUM  INT093_IRQn
#define HC32_TMRA5_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA5_CMP_IRQ_NUM  INT094_IRQn
#define HC32_TMRA5_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA6*/
#define HC32_TMRA6_OVF_IRQ_NUM  INT092_IRQn
#define HC32_TMRA6_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA6_UDF_IRQ_NUM  INT093_IRQn
#define HC32_TMRA6_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA6_CMP_IRQ_NUM  INT094_IRQn
#define HC32_TMRA6_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA7*/
#define HC32_TMRA7_OVF_IRQ_NUM  INT095_IRQn
#define HC32_TMRA7_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA7_UDF_IRQ_NUM  INT096_IRQn
#define HC32_TMRA7_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA7_CMP_IRQ_NUM  INT097_IRQn
#define HC32_TMRA7_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA8*/
#define HC32_TMRA8_OVF_IRQ_NUM  INT095_IRQn
#define HC32_TMRA8_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA8_UDF_IRQ_NUM  INT096_IRQn
#define HC32_TMRA8_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA8_CMP_IRQ_NUM  INT097_IRQn
#define HC32_TMRA8_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA9*/
#define HC32_TMRA9_OVF_IRQ_NUM  INT098_IRQn
#define HC32_TMRA9_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA9_UDF_IRQ_NUM  INT099_IRQn
#define HC32_TMRA9_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA9_CMP_IRQ_NUM  INT100_IRQn
#define HC32_TMRA9_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA10*/
#define HC32_TMRA10_OVF_IRQ_NUM  INT098_IRQn
#define HC32_TMRA10_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA10_UDF_IRQ_NUM  INT099_IRQn
#define HC32_TMRA10_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA10_CMP_IRQ_NUM  INT100_IRQn
#define HC32_TMRA10_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA11*/
#define HC32_TMRA11_OVF_IRQ_NUM  INT101_IRQn
#define HC32_TMRA11_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA11_UDF_IRQ_NUM  INT102_IRQn
#define HC32_TMRA11_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA11_CMP_IRQ_NUM  INT103_IRQn
#define HC32_TMRA11_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* TimerA12*/
#define HC32_TMRA12_OVF_IRQ_NUM  INT101_IRQn
#define HC32_TMRA12_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA12_UDF_IRQ_NUM  INT102_IRQn
#define HC32_TMRA12_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMRA12_CMP_IRQ_NUM  INT103_IRQn
#define HC32_TMRA12_CMP_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer41*/
#define HC32_TMR41_CMP_UH_IRQ_NUM  INT092_IRQn
#define HC32_TMR41_CMP_UH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_CMP_UL_IRQ_NUM  INT093_IRQn
#define HC32_TMR41_CMP_UL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_CMP_VH_IRQ_NUM  INT094_IRQn
#define HC32_TMR41_CMP_VH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_CMP_VL_IRQ_NUM  INT095_IRQn
#define HC32_TMR41_CMP_VL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_CMP_WH_IRQ_NUM  INT012_IRQn
#define HC32_TMR41_CMP_WH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_CMP_WL_IRQ_NUM  INT013_IRQn
#define HC32_TMR41_CMP_WL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_OVF_IRQ_NUM  INT096_IRQn
#define HC32_TMR41_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR41_UDF_IRQ_NUM  INT097_IRQn
#define HC32_TMR41_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer42*/
#define HC32_TMR42_CMP_UH_IRQ_NUM  INT092_IRQn
#define HC32_TMR42_CMP_UH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_CMP_UL_IRQ_NUM  INT093_IRQn
#define HC32_TMR42_CMP_UL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_CMP_VH_IRQ_NUM  INT094_IRQn
#define HC32_TMR42_CMP_VH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_CMP_VL_IRQ_NUM  INT095_IRQn
#define HC32_TMR42_CMP_VL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_CMP_WH_IRQ_NUM  INT012_IRQn
#define HC32_TMR42_CMP_WH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_CMP_WL_IRQ_NUM  INT013_IRQn
#define HC32_TMR42_CMP_WL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_OVF_IRQ_NUM  INT096_IRQn
#define HC32_TMR42_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR42_UDF_IRQ_NUM  INT097_IRQn
#define HC32_TMR42_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer43 */
#define HC32_TMR43_CMP_UH_IRQ_NUM  INT098_IRQn
#define HC32_TMR43_CMP_UH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_CMP_UL_IRQ_NUM  INT099_IRQn
#define HC32_TMR43_CMP_UL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_CMP_VH_IRQ_NUM  INT100_IRQn
#define HC32_TMR43_CMP_VH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

