zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f4a0-intc.h
#define HC32_TMR43_CMP_VL_IRQ_NUM  INT101_IRQn
#define HC32_TMR43_CMP_VL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_CMP_WH_IRQ_NUM  INT012_IRQn
#define HC32_TMR43_CMP_WH_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_CMP_WL_IRQ_NUM  INT013_IRQn
#define HC32_TMR43_CMP_WL_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_OVF_IRQ_NUM  INT102_IRQn
#define HC32_TMR43_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR43_UDF_IRQ_NUM  INT103_IRQn
#define HC32_TMR43_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer61 interrupt */
#define HC32_TMR61_CMPA_IRQ_NUM  INT056_IRQn
#define HC32_TMR61_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_CMPB_IRQ_NUM  INT057_IRQn
#define HC32_TMR61_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_CMPC_IRQ_NUM  INT058_IRQn
#define HC32_TMR61_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_CMPD_IRQ_NUM  INT059_IRQn
#define HC32_TMR61_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_CMPE_IRQ_NUM  INT060_IRQn
#define HC32_TMR61_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_CMPF_IRQ_NUM  INT061_IRQn
#define HC32_TMR61_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_OVF_IRQ_NUM  INT030_IRQn
#define HC32_TMR61_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR61_UDF_IRQ_NUM  INT031_IRQn
#define HC32_TMR61_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer62 interrupt */
#define HC32_TMR62_CMPA_IRQ_NUM  INT056_IRQn
#define HC32_TMR62_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_CMPB_IRQ_NUM  INT057_IRQn
#define HC32_TMR62_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_CMPC_IRQ_NUM  INT058_IRQn
#define HC32_TMR62_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_CMPD_IRQ_NUM  INT059_IRQn
#define HC32_TMR62_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_CMPE_IRQ_NUM  INT060_IRQn
#define HC32_TMR62_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_CMPF_IRQ_NUM  INT061_IRQn
#define HC32_TMR62_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_OVF_IRQ_NUM  INT030_IRQn
#define HC32_TMR62_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR62_UDF_IRQ_NUM  INT031_IRQn
#define HC32_TMR62_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer63 interrupt */
#define HC32_TMR63_CMPA_IRQ_NUM  INT062_IRQn
#define HC32_TMR63_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_CMPB_IRQ_NUM  INT063_IRQn
#define HC32_TMR63_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_CMPC_IRQ_NUM  INT064_IRQn
#define HC32_TMR63_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_CMPD_IRQ_NUM  INT065_IRQn
#define HC32_TMR63_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_CMPE_IRQ_NUM  INT066_IRQn
#define HC32_TMR63_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_CMPF_IRQ_NUM  INT067_IRQn
#define HC32_TMR63_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_OVF_IRQ_NUM  INT028_IRQn
#define HC32_TMR63_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR63_UDF_IRQ_NUM  INT029_IRQn
#define HC32_TMR63_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer64 interrupt */
#define HC32_TMR64_CMPA_IRQ_NUM  INT068_IRQn
#define HC32_TMR64_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_CMPB_IRQ_NUM  INT069_IRQn
#define HC32_TMR64_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_CMPC_IRQ_NUM  INT070_IRQn
#define HC32_TMR64_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_CMPD_IRQ_NUM  INT071_IRQn
#define HC32_TMR64_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_CMPE_IRQ_NUM  INT072_IRQn
#define HC32_TMR64_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_CMPF_IRQ_NUM  INT073_IRQn
#define HC32_TMR64_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_OVF_IRQ_NUM  INT026_IRQn
#define HC32_TMR64_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR64_UDF_IRQ_NUM  INT027_IRQn
#define HC32_TMR64_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer65 interrupt */
#define HC32_TMR65_CMPA_IRQ_NUM  INT074_IRQn
#define HC32_TMR65_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_CMPB_IRQ_NUM  INT075_IRQn
#define HC32_TMR65_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_CMPC_IRQ_NUM  INT076_IRQn
#define HC32_TMR65_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_CMPD_IRQ_NUM  INT077_IRQn
#define HC32_TMR65_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_CMPE_IRQ_NUM  INT078_IRQn
#define HC32_TMR65_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_CMPF_IRQ_NUM  INT079_IRQn
#define HC32_TMR65_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_OVF_IRQ_NUM  INT024_IRQn
#define HC32_TMR65_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR65_UDF_IRQ_NUM  INT025_IRQn
#define HC32_TMR65_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer66 interrupt */
#define HC32_TMR66_CMPA_IRQ_NUM  INT074_IRQn
#define HC32_TMR66_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_CMPB_IRQ_NUM  INT075_IRQn
#define HC32_TMR66_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_CMPC_IRQ_NUM  INT076_IRQn
#define HC32_TMR66_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_CMPD_IRQ_NUM  INT077_IRQn
#define HC32_TMR66_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_CMPE_IRQ_NUM  INT078_IRQn
#define HC32_TMR66_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_CMPF_IRQ_NUM  INT079_IRQn
#define HC32_TMR66_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_OVF_IRQ_NUM  INT024_IRQn
#define HC32_TMR66_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR66_UDF_IRQ_NUM  INT025_IRQn
#define HC32_TMR66_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer67 interrupt */
#define HC32_TMR67_CMPA_IRQ_NUM  INT080_IRQn
#define HC32_TMR67_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_CMPB_IRQ_NUM  INT081_IRQn
#define HC32_TMR67_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_CMPC_IRQ_NUM  INT082_IRQn
#define HC32_TMR67_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_CMPD_IRQ_NUM  INT083_IRQn
#define HC32_TMR67_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_CMPE_IRQ_NUM  INT084_IRQn
#define HC32_TMR67_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_CMPF_IRQ_NUM  INT085_IRQn
#define HC32_TMR67_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_OVF_IRQ_NUM  INT022_IRQn
#define HC32_TMR67_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR67_UDF_IRQ_NUM  INT023_IRQn
#define HC32_TMR67_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* Timer68 interrupt */
#define HC32_TMR68_CMPA_IRQ_NUM  INT080_IRQn
#define HC32_TMR68_CMPA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_CMPB_IRQ_NUM  INT081_IRQn
#define HC32_TMR68_CMPB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_CMPC_IRQ_NUM  INT082_IRQn
#define HC32_TMR68_CMPC_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

