zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/interrupt-controller/hc32f4a0-intc.h
#define HC32_TMR68_CMPD_IRQ_NUM  INT083_IRQn
#define HC32_TMR68_CMPD_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_CMPE_IRQ_NUM  INT084_IRQn
#define HC32_TMR68_CMPE_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_CMPF_IRQ_NUM  INT085_IRQn
#define HC32_TMR68_CMPF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_OVF_IRQ_NUM  INT022_IRQn
#define HC32_TMR68_OVF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#define HC32_TMR68_UDF_IRQ_NUM  INT023_IRQn
#define HC32_TMR68_UDF_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* I2C share */
#define HC32_I2C_IRQ_SHARE1_NUM  INT141_IRQn
#define HC32_I2C_IRQ_SHARE1_PRIO DDL_IRQ_PRIO_DEFAULT
/* I2C1 */
#define HC32_I2C1_EE_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C1_EE_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C1_TE_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C1_TE_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C1_TX_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C1_TX_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C1_RX_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C1_RX_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
/* I2C2 */
#define HC32_I2C2_EE_IRQ_NUM     INT110_IRQn
#define HC32_I2C2_EE_IRQ_PRIO    DDL_IRQ_PRIO_DEFAULT
#define HC32_I2C2_TE_IRQ_NUM     INT111_IRQn
#define HC32_I2C2_TE_IRQ_PRIO    DDL_IRQ_PRIO_DEFAULT
#define HC32_I2C2_TX_IRQ_NUM     INT112_IRQn
#define HC32_I2C2_TX_IRQ_PRIO    DDL_IRQ_PRIO_DEFAULT
#define HC32_I2C2_RX_IRQ_NUM     INT113_IRQn
#define HC32_I2C2_RX_IRQ_PRIO    DDL_IRQ_PRIO_DEFAULT
/* I2C3 */
#define HC32_I2C3_EE_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C3_EE_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C3_TE_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C3_TE_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C3_TX_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C3_TX_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO
#define HC32_I2C3_RX_IRQ_NUM     HC32_I2C_IRQ_SHARE1_NUM
#define HC32_I2C3_RX_IRQ_PRIO    HC32_I2C_IRQ_SHARE1_PRIO

#define HC32_I2C_IRQ_SHARE2_NUM  INT142_IRQn
#define HC32_I2C_IRQ_SHARE2_PRIO DDL_IRQ_PRIO_DEFAULT
/* I2C4 */
#define HC32_I2C4_EE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C4_EE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C4_TE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C4_TE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C4_TX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C4_TX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C4_RX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C4_RX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
/* I2C5 */
#define HC32_I2C5_EE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C5_EE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C5_TE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C5_TE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C5_TX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C5_TX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C5_RX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C5_RX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
/* I2C6 */
#define HC32_I2C6_EE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C6_EE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C6_TE_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C6_TE_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C6_TX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C6_TX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO
#define HC32_I2C6_RX_IRQ_NUM     HC32_I2C_IRQ_SHARE2_NUM
#define HC32_I2C6_RX_IRQ_PRIO    HC32_I2C_IRQ_SHARE2_PRIO

/* ADC */
#define HC32_ADC1_EOCA_IRQ_NUM  INT122_IRQn
#define HC32_ADC1_EOCA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT
#define HC32_ADC1_EOCB_IRQ_NUM  INT123_IRQn
#define HC32_ADC1_EOCB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT
#define HC32_ADC2_EOCA_IRQ_NUM  INT122_IRQn
#define HC32_ADC2_EOCA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT
#define HC32_ADC2_EOCB_IRQ_NUM  INT123_IRQn
#define HC32_ADC2_EOCB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT
#define HC32_ADC3_EOCA_IRQ_NUM  INT122_IRQn
#define HC32_ADC3_EOCA_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT
#define HC32_ADC3_EOCB_IRQ_NUM  INT123_IRQn
#define HC32_ADC3_EOCB_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

/* QSPI */
#define HC32_QSPI_IRQ_NUM  INT043_IRQn
#define HC32_QSPI_IRQ_PRIO DDL_IRQ_PRIO_DEFAULT

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_INTERRUPT_CONTROLLER_HC32F4A0_INTC_H_ */
